alibaba/AliOS-Things/platform/mcu/stm32l475/Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_lcd.c
  }
  else
  {
    i++;
  }

  /* Optional delay to slow down the dimming transition. */
  HAL_Delay(PULSE_DECREASE_DELAY);
  if (HAL_LPTIM_PWM_Start(&LCD_LpTimHandle, PERIOD_VALUE, i) != HAL_OK)
  {
    BSP_ErrorHandler();
  }
  if (i == PULSE_VALUE)
  {
    dimming_enable = 0;
  }


#else
  /* Counter Prescaler value */
  uint32_t uhPrescalerValue = 0;
  int32_t   step;

  /* Reject this while ongoing dimming */
  if (dimming_config.ongoing)
  {
    return;
  }

  /* Set that dim feature is active */
  dimming_on = 1;
  dimming_config.ongoing = 1;

  if (dimming_config.stop > dimming_config.start)
  {
    step      = dimming_config.step;
  }
  else
  {
    step      = -dimming_config.step;
  }

  /* Always redo the full initialization as there is no apriori knowledge
    of IO or timer settings at this point (may have been modified by application) */

  /* Compute the prescaler value to have TIM1 counter clock equal to 16000000 Hz */
  uhPrescalerValue = (uint32_t)(SystemCoreClock / 16000000) - 1;

  LCD_TimHandle.Instance = TIMx;

  __HAL_TIM_RESET_HANDLE_STATE(&LCD_TimHandle); /* to force MSP call */
  LCD_TimHandle.Init.Prescaler         = uhPrescalerValue;
  LCD_TimHandle.Init.Period            = PERIOD_VALUE;
  LCD_TimHandle.Init.ClockDivision     = 0;
  LCD_TimHandle.Init.CounterMode       = (step > 0 ? TIM_COUNTERMODE_DOWN : TIM_COUNTERMODE_UP);
  LCD_TimHandle.Init.RepetitionCounter = 0;
  if (HAL_TIM_PWM_Init(&LCD_TimHandle) != HAL_OK)
  {
    /* Initialization Error */
    BSP_ErrorHandler();
  }

  /* Common configuration for all channels */
  LCD_sConfig.OCMode       = TIM_OCMODE_PWM1;
  LCD_sConfig.OCPolarity   = TIM_OCPOLARITY_HIGH;
  LCD_sConfig.OCFastMode   = TIM_OCFAST_DISABLE;
  LCD_sConfig.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  LCD_sConfig.OCNIdleState = TIM_OCNIDLESTATE_RESET;

  LCD_sConfig.OCIdleState  = TIM_OCIDLESTATE_RESET;

  /* Set the pulse value for channel */
  LCD_sConfig.Pulse = __DIMMING_CYCLE_VALUE(dimming_config.start);
  if (HAL_TIM_PWM_ConfigChannel(&LCD_TimHandle, &LCD_sConfig, TIMx_CHANNEL) != HAL_OK)
  {
    /* Configuration Error */
    BSP_ErrorHandler();
  }

  /* Start Timer channel */
  if (HAL_TIM_PWM_Start(&LCD_TimHandle, TIMx_CHANNEL) != HAL_OK)
  {
    /* PWM Generation Error */
    BSP_ErrorHandler();
  }

  /* Set the pulse value for the timer channel */
  i = dimming_config.start;
  while (dimming_config.ongoing)
  {
    __HAL_TIM_SET_COMPARE(&LCD_TimHandle, TIMx_CHANNEL, __DIMMING_CYCLE_VALUE(i));

    /* Exit if stop is reached */
    if (((step > 0) && (i >= dimming_config.stop))
        || ((step < 0) && (i <= dimming_config.stop)))
    {
      dimming_config.ongoing = 0;
    }
    else
    {
      HAL_Delay(dimming_config.delay);
      i += step;
    }
  }
#endif
}

/**
  * @brief  LCD screen dimming disable
  * @note   Screen brightness is immediatly set to its highest level
  * @param  None
  * @retval None
  */
void BSP_LCD_ScreenDimmingOff(void)
{
#if defined(LPTIMER_DIMMING)
  GPIO_InitTypeDef GPIO_InitStructure;
#endif

  if (dimming_on == 1)
  {
    /* Stop ongoing dimming */
    dimming_config.ongoing = 0;

#if defined(LPTIMER_DIMMING)

    /* Restore LCD BL GPIO setting */
    GPIO_InitStructure.Pin       = LCD_BL_CTRL_PIN;
    GPIO_InitStructure.Mode      = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStructure.Pull      = GPIO_NOPULL;
    GPIO_InitStructure.Alternate = 0;
    GPIO_InitStructure.Speed   = GPIO_SPEED_LOW;
    HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_InitStructure);

    /* Stop LP Timer channel */
    if (HAL_LPTIM_PWM_Stop(&LCD_LpTimHandle) != HAL_OK)
    {
      /* PWM Generation Error */
      BSP_ErrorHandler();
    }

    /* Disable timer clock for power consumption reasons */
    __HAL_RCC_LPTIM1_CLK_DISABLE();
#else
    /* Stop Timer channel */
    if (HAL_TIM_PWM_Stop(&LCD_TimHandle, TIMx_CHANNEL) != HAL_OK)
    {
      /* PWM Generation Error */
      BSP_ErrorHandler();
    }

    /* Disable timer clock for power consumption reasons */
    TIMx_CLK_DISABLE();
#endif

    dimming_on = 0;
  }
}



/**
  * @brief TIM MSP Initialization
  *        This function configures the hardware resources used for screen dimming:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param htim: TIM handle pointer
  * @retval None
  */
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
  GPIO_InitTypeDef   GPIO_InitStruct;

  /* TIMx Peripheral clock enable */
  TIMx_CLK_ENABLE();

  /* Timer channel configuration */

  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

  GPIO_InitStruct.Alternate = TIMx_CHANNEl_AF;
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  HAL_GPIO_Init(GPIOI, &GPIO_InitStruct);
}


#if defined(LPTIMER_DIMMING)
/**
* @brief  LPTIM MSP Init
* @param  hlptim : LPTIM handle
* @retval None
*/
void HAL_LPTIM_MspInit(LPTIM_HandleTypeDef *hlptim)
{
  GPIO_InitTypeDef     GPIO_InitStruct;

  /* ## - 1 - Enable LPTIM clock ############################################ */
  __HAL_RCC_LPTIM1_CLK_ENABLE();

  /* ## - 2 - Force & Release the LPTIM Periheral Clock Reset ############### */
  /* Force the LPTIM Periheral Clock Reset */
  __HAL_RCC_LPTIM1_FORCE_RESET();

  /* Release the LPTIM Periheral Clock Reset */
  __HAL_RCC_LPTIM1_RELEASE_RESET();

  /* ## - 3 - Enable & Configure LPTIM Ultra Low Power Input ################# */
  /* Configure PG.15 (LPTIM1_OUT) in alternate function,
  Low speed push-pull mode and pull-up enabled. */

  /* Enable GPIO PORT(s)*/
  LCD_BL_CTRL_GPIO_CLK_ENABLE();

  /* Configure Backlight control pin GPIO  */
  GPIO_InitStruct.Pin = LCD_BL_CTRL_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF1_LPTIM1;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_InitStruct);
}
#endif /* defined(LPTIMER_DIMMING) */

uint8_t BSP_LCD_GetOrientation(void)
{
  return LCD_orientation;
}

/**
  * @brief  Initializes the LCD GPIO special pins MSP.
  * @param  None
  * @retval None
  */
__weak void BSP_LCD_MspInit(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIOs clock */
  LCD_TE_GPIO_CLK_ENABLE();
  LCD_BL_CTRL_GPIO_CLK_ENABLE();
  LCD_PWR_CTRL_GPIO_CLK_ENABLE();

  /* LCD_RESET GPIO configuration */
  if (BSP_IO_Init() == IO_ERROR)
  {
    BSP_ErrorHandler();
  }
  BSP_IO_ConfigPin(LCD_RST_PIN, IO_MODE_OUTPUT);

  /* LCD_BL_CTRL GPIO configuration */
  GPIO_InitStructure.Pin       = LCD_BL_CTRL_PIN;   /* LCD_BL_CTRL pin has to be manually controlled */
  GPIO_InitStructure.Mode      = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStructure.Pull      = GPIO_NOPULL;
  GPIO_InitStructure.Alternate = 0;
  GPIO_InitStructure.Speed   = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &GPIO_InitStructure);

